## Terraform Quality Check Update 🤖
This is an automated message generated by the Terraform-Quality-Check workflow run. It displays the statuses of the formatting, initialisation and validation of the Terraform source files.

## Quality Check 
<details>
<summary><h4>🖌 Terraform Format and Style</h4></summary>
``
</details>

<details>
<summary><h4>⚙️ Terraform Initialization</h4></summary>
`[0m[1mInitializing the backend...[0m
[0m[1mUpgrading modules...[0m
- repositories in modules/repository
[0m[1mInitializing provider plugins...[0m
- Finding integrations/github versions matching "6.2.2"...
- Installing integrations/github v6.2.2...
- Installed integrations/github v6.2.2 (signed by a HashiCorp partner, key ID [0m[1m38027F80D7FD5FB2[0m[0m)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
`
</details>

<details>
<summary><h4>✅ Terraform Validation</h4></summary>
`Success! The configuration is valid.

`
</details>

## Plan 
<details>
<summary><h4>Plan Output</h4></summary>
`
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.repositories.github_repository.managed_repositories["go_worker_template"][0m will be created
[0m  [32m+[0m[0m resource "github_repository" "managed_repositories" {
      [32m+[0m[0m allow_auto_merge            = false
      [32m+[0m[0m allow_merge_commit          = true
      [32m+[0m[0m allow_rebase_merge          = true
      [32m+[0m[0m allow_squash_merge          = true
      [32m+[0m[0m archived                    = false
      [32m+[0m[0m default_branch              = (known after apply)
      [32m+[0m[0m delete_branch_on_merge      = true
      [32m+[0m[0m description                 = "A repository template for backend workers written in the Go language."
      [32m+[0m[0m etag                        = (known after apply)
      [32m+[0m[0m full_name                   = (known after apply)
      [32m+[0m[0m git_clone_url               = (known after apply)
      [32m+[0m[0m gitignore_template          = "Go"
      [32m+[0m[0m has_discussions             = false
      [32m+[0m[0m has_issues                  = true
      [32m+[0m[0m has_projects                = false
      [32m+[0m[0m has_wiki                    = false
      [32m+[0m[0m html_url                    = (known after apply)
      [32m+[0m[0m http_clone_url              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m is_template                 = true
      [32m+[0m[0m merge_commit_message        = "PR_TITLE"
      [32m+[0m[0m merge_commit_title          = "MERGE_MESSAGE"
      [32m+[0m[0m name                        = "go_worker_template"
      [32m+[0m[0m node_id                     = (known after apply)
      [32m+[0m[0m primary_language            = (known after apply)
      [32m+[0m[0m private                     = (known after apply)
      [32m+[0m[0m repo_id                     = (known after apply)
      [32m+[0m[0m squash_merge_commit_message = "COMMIT_MESSAGES"
      [32m+[0m[0m squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      [32m+[0m[0m ssh_clone_url               = (known after apply)
      [32m+[0m[0m svn_url                     = (known after apply)
      [32m+[0m[0m topics                      = [
          [32m+[0m[0m "cd",
          [32m+[0m[0m "ci",
          [32m+[0m[0m "docker",
          [32m+[0m[0m "golang",
          [32m+[0m[0m "worker",
        ]
      [32m+[0m[0m visibility                  = "public"
      [32m+[0m[0m web_commit_signoff_required = false

      [32m+[0m[0m security_and_analysis (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m github_repositories_full_names = {
      [32m+[0m[0m go_worker_template = (known after apply)
    }
  [32m+[0m[0m github_repositories_html_urls  = {
      [32m+[0m[0m go_worker_template = (known after apply)
    }
`
</details>

*Pusher: @RazvanBerbece, Action: `pull_request`*